Lab2: Write a Pandas program to create a Pivot table and find the item wise
unit sold.

In [1]:
import numpy as np
import pandas as pd

In [3]:
#read_csv() -> Read csv file into DataFrame
df=pd.read_csv("salesdata.csv")

In [4]:
#head() -> Shows the first five rows of DataFrame
df.head()

    Region  Manager   SalesMan          Item  Units  Unit_price  Sale_amt
0     East   Martha  Alexander    Television     95      1198.0  113810.0
1  Central  Hermann     Shelli  Home Theater     50       500.0   25000.0
2  Central  Hermann       Luis    Television     36      1198.0   43128.0
3  Central  Timothy      David    Cell Phone     27       225.0    6075.0
4     West  Timothy    Stephen    Television     56      1198.0   67088.0

In [6]:
#Create pivot table for item wise unit sold.
pd.pivot_table(df,index=['Item'],values=['Units'],aggfunc=['sum'])

               sum
             Units
Item
Cell Phone     278
Desk            10
Home Theater   722
Television     716
Video Games    395